PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_aes_v2.c
    aesCcmState->y[0] |= (uint8_t)(aesCcmState->aadLength > 0u) << 6u;
    aesCcmState->y[0] |= ((aesCcmState->tagLength - 2u) / 2u) << 3u;
    aesCcmState->y[0] |= (uint8_t)aesCcmState->L - 1u;

    size_left = aesCcmState->textLength;
    for (uint32_t i = 0u; i < aesCcmState->L; i++)
    {
        aesCcmState->y[15u - i] = (uint8_t)size_left & 0xffu ;
        size_left >>= 8u;
    }

    __DSB();
#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    SCB_CleanDCache_by_Addr((volatile void*)aesCcmState->y, (int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
#endif
    // Performs the CBC MAC update operation for the Initial Block data formatted with flags and length
    status = Cy_Crypto_Core_V2_Aes_CbcMac_Update(base, CY_CRYPTO_AES_BLOCK_SIZE, aesCcmState->y, &aesCcmState->aesCbcMacState);
    if (CY_CRYPTO_SUCCESS != status)
    {
        return status;
    }

    if (aesCcmState->aadLength > 0u)
    {
        aesCcmState->temp[0] = (uint8_t)(aesCcmState->aadLength >> 8u) & 0xffu;
        aesCcmState->temp[1] = (uint8_t)(aesCcmState->aadLength & 0xffu);
        __DSB();
#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
        SCB_CleanDCache_by_Addr((volatile void*)aesCcmState->temp, (int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
#endif

        status = Cy_Crypto_Core_V2_Aes_CbcMac_Update(base, 2u, aesCcmState->temp, &aesCcmState->aesCbcMacState);

        if (CY_CRYPTO_SUCCESS != status)
        {
            return status;
        }

        aesCcmState->aadLengthProcessed += 2u;
    }

    return CY_CRYPTO_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_Ccm_Set_Length
****************************************************************************//*
*
* Sets the length for Additional authentication data, plain text and Tag for AES CCM operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param aadSize
* The Size of the Additional Authentication Data.
*
* \param textSize
* The Size of the Text.
*
* \param tagLength
* The Size of the Tag.
*
* \param aesCcmState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_Ccm_Set_Length(CRYPTO_Type *base,
        uint32_t aadSize,  uint32_t textSize, uint32_t tagLength,
        cy_stc_crypto_aes_ccm_state_t *aesCcmState)
{
    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesCcmState))
    {
        return CY_CRYPTO_BAD_PARAMS;
    }

    if (tagLength < 3u || tagLength > CY_CRYPTO_AES_BLOCK_SIZE || (tagLength % 2u != 0u))
    {
        return CY_CRYPTO_BAD_PARAMS;
    }

    if (aadSize >= 0xFF00UL)
    {
        return CY_CRYPTO_BAD_PARAMS;
    }

    aesCcmState->textLength = textSize;
    aesCcmState->aadLength = aadSize;
    aesCcmState->tagLength = (uint8_t)tagLength;
    aesCcmState->aadLengthProcessed = 0u;
    aesCcmState->isAadProcessed = false;
    aesCcmState->isLengthSet = true;

    return Cy_Crypto_Core_V2_Aes_Ccm_Initial_Block(base, aesCcmState);
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_Ccm_Start
****************************************************************************//*
*
* Function to set IV for the AES CCM operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param dirMode
* Can be \ref CY_CRYPTO_ENCRYPT or \ref CY_CRYPTO_DECRYPT
* (\ref cy_en_crypto_dir_mode_t)
*
* \param ivSize
* The size of the IV.
*
* \param iv
* The pointer to the IV.
*
* \param aesCcmState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/

cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_Ccm_Start(CRYPTO_Type *base,
        cy_en_crypto_dir_mode_t dirMode,
        uint32_t ivSize, uint8_t const * iv,
        cy_stc_crypto_aes_ccm_state_t *aesCcmState)
{

    cy_en_crypto_status_t status = CY_CRYPTO_BAD_PARAMS;

    /* Input parameters verification */
    if ((NULL == base) || (NULL == iv) || (NULL == aesCcmState))
    {
        return CY_CRYPTO_BAD_PARAMS;
    }

    if (ivSize < 7u || ivSize > 13u)
    {
        return status;
    }

    aesCcmState->dirMode = dirMode;
    aesCcmState->L = CY_CRYPTO_AES_BLOCK_SIZE - ivSize - 1u;
    aesCcmState->isIvSet = true;

    Cy_Crypto_Core_V2_MemSet(base, aesCcmState->ctr, 0u, CY_CRYPTO_AES_BLOCK_SIZE);
    aesCcmState->ctr[0] = (uint8_t)aesCcmState->L - 1u;
    aesCcmState->ctr[15] = 1u;

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    SCB_CleanDCache_by_Addr((volatile void*)aesCcmState->ctr, (int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
#endif
    __DSB();

    Cy_Crypto_Core_V2_MemCpy(base, (void*)&aesCcmState->ctr[1], (void*)iv, (uint16_t)ivSize);

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    SCB_InvalidateDCache_by_Addr((volatile void *)aesCcmState->ctr, (int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
#endif
    Cy_Crypto_Core_V2_MemSet(base, aesCcmState->y, 0u, CY_CRYPTO_AES_BLOCK_SIZE);
    Cy_Crypto_Core_V2_MemCpy(base, (void*)&aesCcmState->y[1], (void*)iv, (uint16_t)ivSize);

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    SCB_InvalidateDCache_by_Addr((volatile void *)aesCcmState->y, (int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
#endif
    // Sets the IV for the AES CTR operation
    status = Cy_Crypto_Core_V2_Aes_Ctr_Setup(base, &aesCcmState->aesCtrState);
    if (CY_CRYPTO_SUCCESS != status)
    {
        return status;
    }

    status = Cy_Crypto_Core_V2_Aes_Ctr_Set_IV(base, aesCcmState->ctr, &aesCcmState->aesCtrState);
    if (CY_CRYPTO_SUCCESS != status)
    {
        return status;
    }

    return Cy_Crypto_Core_V2_Aes_Ccm_Initial_Block(base, aesCcmState);
}



