PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_aes_v2.c
/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_Ccm_Update_Aad
****************************************************************************//*
*
* Performs an AES CCM update AAD Multistage  operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param aadSize
* The size of the AAD.
*
* \param aad
* The pointer to a AAD.
*
* \param aesCcmState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_Ccm_Update_Aad(CRYPTO_Type *base,
        uint32_t aadSize,
        uint8_t const *aad,
        cy_stc_crypto_aes_ccm_state_t *aesCcmState)


{
    cy_en_crypto_status_t status = CY_CRYPTO_BAD_PARAMS;

    if (0u == aadSize)
    {
        return CY_CRYPTO_SUCCESS;
    }

    if (aadSize >= 0xFF00UL)
    {
        return CY_CRYPTO_BAD_PARAMS;
    }

    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesCcmState) || (NULL == aad))
    {
        return CY_CRYPTO_BAD_PARAMS;
    }

    status = Cy_Crypto_Core_V2_Aes_CbcMac_Update(base, aadSize, aad, &aesCcmState->aesCbcMacState);
    if (CY_CRYPTO_SUCCESS != status)
    {
        return status;
    }

    aesCcmState->aadLengthProcessed += aadSize;

    return status;
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_Ccm_Update
****************************************************************************//*
*
* Performs an AES CCM Update Multistage update operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param srcSize
* The size of the source block.
*
* \param dst
* The pointer to a destination block.
*
* \param src
* The pointer to a source block.
*
* \param aesCcmState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_Ccm_Update(CRYPTO_Type *base,
        uint32_t srcSize,
        uint8_t *dst,
        uint8_t const *src,
        cy_stc_crypto_aes_ccm_state_t *aesCcmState)


{
    cy_en_crypto_status_t status = CY_CRYPTO_BAD_PARAMS;
    uint8_t *temp = NULL;
    uint8_t *cipherText_ptr;

    if (0u == srcSize)
    {
        return CY_CRYPTO_SUCCESS;
    }

    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesCcmState) || (NULL == dst) || (NULL == src))
    {
        return CY_CRYPTO_BAD_PARAMS;
    }

    temp = aesCcmState->temp;

    Cy_Crypto_Core_V2_MemSet(base, temp, 0u, CY_CRYPTO_AES_BLOCK_SIZE);

    if (aesCcmState->aadLengthProcessed % CY_CRYPTO_AES_BLOCK_SIZE != 0u && aesCcmState->isAadProcessed == false)
    {
        status = Cy_Crypto_Core_V2_Aes_CbcMac_Update(base,  CY_CRYPTO_AES_BLOCK_SIZE - aesCcmState->aadLengthProcessed % CY_CRYPTO_AES_BLOCK_SIZE, temp, &aesCcmState->aesCbcMacState);
        if (CY_CRYPTO_SUCCESS != status)
        {
            return status;
        }

        aesCcmState->isAadProcessed = true;
    }

    status =  Cy_Crypto_Core_V2_Aes_Ctr_Update(base, srcSize, dst, src, &aesCcmState->aesCtrState);
    if (CY_CRYPTO_SUCCESS != status)
    {
        return status;
    }

    if (aesCcmState->dirMode == CY_CRYPTO_ENCRYPT)
    {
        cipherText_ptr = (uint8_t *)src;
    }
    else
    {
        cipherText_ptr = dst;
    }

    status = Cy_Crypto_Core_V2_Aes_CbcMac_Update(base, srcSize, cipherText_ptr, &aesCcmState->aesCbcMacState);

    return status;
}



/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_Ccm_Finish
****************************************************************************//*
*
* Performs an AES CCM finish operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param tag
* The pointer to the CCM Tag.
*
* \param aesCcmState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_Ccm_Finish(CRYPTO_Type *base, uint8_t *tag, cy_stc_crypto_aes_ccm_state_t *aesCcmState)
{
    uint8_t *temp = NULL;
#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    uint8_t y_t[CY_CRYPTO_ALIGN_CACHE_LINE(CY_CRYPTO_AES_BLOCK_SIZE) + CY_CRYPTO_DCAHCE_PADDING_SIZE] = {0u};
    uint8_t *y = (uint8_t*)CY_CRYPTO_DCACHE_ALIGN_ADDRESS(y_t);
#else
    uint8_t y[CY_CRYPTO_ALIGN_CACHE_LINE(CY_CRYPTO_AES_BLOCK_SIZE)] = {0u};
#endif
    cy_en_crypto_status_t status = CY_CRYPTO_BAD_PARAMS;

    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesCcmState))
    {
        return CY_CRYPTO_BAD_PARAMS;
    }

    temp = aesCcmState->temp;

    Cy_Crypto_Core_V2_MemSet(base, temp, 0u, CY_CRYPTO_AES_BLOCK_SIZE);
    Cy_Crypto_Core_V2_MemSet(base, y, 0u, CY_CRYPTO_AES_BLOCK_SIZE);

    if (aesCcmState->aadLengthProcessed % CY_CRYPTO_AES_BLOCK_SIZE != 0u && aesCcmState->isAadProcessed == false)
    {
        status = Cy_Crypto_Core_V2_Aes_CbcMac_Update(base,  CY_CRYPTO_AES_BLOCK_SIZE - aesCcmState->aadLengthProcessed % CY_CRYPTO_AES_BLOCK_SIZE, temp, &aesCcmState->aesCbcMacState);
        if (CY_CRYPTO_SUCCESS != status)
        {
            return status;
        }
    }

    if (aesCcmState->textLength % CY_CRYPTO_AES_BLOCK_SIZE  != 0u)
    {
        status = Cy_Crypto_Core_V2_Aes_CbcMac_Update(base, CY_CRYPTO_AES_BLOCK_SIZE - aesCcmState->textLength % CY_CRYPTO_AES_BLOCK_SIZE, temp, &aesCcmState->aesCbcMacState);
        if (CY_CRYPTO_SUCCESS != status)
        {
            return status;
        }
    }

    status = Cy_Crypto_Core_V2_Aes_CbcMac_Finish(base, temp, &aesCcmState->aesCbcMacState);
    if (CY_CRYPTO_SUCCESS != status)
    {
        return status;
    }

    for (uint32_t i = 0u; i < aesCcmState->L; i++)
    {
        aesCcmState->aesCtrState.buffers->iv[15u-i] = 0u;
    }

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    SCB_CleanDCache_by_Addr((volatile void *)aesCcmState->aesCtrState.buffers->iv, (int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
#endif
    aesCcmState->aesCtrState.unProcessedBytes = 0u;

