PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_aes_v2.c
    status = Cy_Crypto_Core_V2_Aes_Ctr_Update(base, CY_CRYPTO_AES_BLOCK_SIZE,
             y,
             temp,
             &aesCcmState->aesCtrState);

    if (CY_CRYPTO_SUCCESS != status)
    {
        return status;
    }

    Cy_Crypto_Core_V2_MemCpy(base, (void*)tag, (void*)y, aesCcmState->tagLength);
    Cy_Crypto_Core_V2_MemSet(base, aesCcmState->ctr, 0u, CY_CRYPTO_AES_BLOCK_SIZE);
    Cy_Crypto_Core_V2_MemSet(base, aesCcmState->y, 0u, CY_CRYPTO_AES_BLOCK_SIZE);

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    SCB_InvalidateDCache_by_Addr((volatile void *)tag, (int32_t)aesCcmState->tagLength);
    SCB_InvalidateDCache_by_Addr((volatile void *)aesCcmState->ctr, (int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
    SCB_InvalidateDCache_by_Addr((volatile void *)aesCcmState->y, (int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
#endif
    aesCcmState->isIvSet = false;
    aesCcmState->isAadProcessed = false;

    return status;
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_Ccm
****************************************************************************//*
*
* Performs an AES CCM operation.
* \note Cy_Crypto_Core_V2_Aes_Ccm_Init() and Cy_Crypto_Core_V2_Aes_Ccm_SetKey() should be called before calling this function.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param dirMode
* Can be \ref CY_CRYPTO_ENCRYPT or \ref CY_CRYPTO_DECRYPT
* (\ref cy_en_crypto_dir_mode_t)
*
* \param ivSize
* The size of the IV.
*
* \param iv
* The pointer to the IV.
*
* \param aadSize
* The size of the AAD.
*
* \param aad
* The pointer to a AAD.
*
* \param srcSize
* The size of the source block.
*
* \param dst
* The pointer to a destination block.
*
* \param src
* The pointer to a source block.
*
* \param tagSize
* The size of the Tag.
*
* \param tag
* The pointer to the tags.
*
* \param aesCcmState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
static cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_Ccm(CRYPTO_Type *base,
        cy_en_crypto_dir_mode_t dirMode,
        uint32_t ivSize, uint8_t const * iv,
        uint32_t aadSize, uint8_t const *aad,
        uint32_t srcSize, uint8_t *dst, uint8_t const *src,
        uint32_t tagSize, uint8_t *tag,
        cy_stc_crypto_aes_ccm_state_t *aesCcmState)

{
    cy_en_crypto_status_t status = CY_CRYPTO_BAD_PARAMS;

    /* Input parameters verification */
    if ((NULL == base) || ((NULL == iv) && (ivSize > 0u)) || ((NULL == aad) && (aadSize > 0u)) ||
            ((srcSize > 0u) && ((NULL == dst) || (NULL == src))) || (NULL == aesCcmState) || (NULL == tag))
    {
        return status;
    }

    status = Cy_Crypto_Core_V2_Aes_Ccm_Set_Length(base, aadSize,  srcSize, tagSize, aesCcmState);

    if (CY_CRYPTO_SUCCESS != status)
    {
        return status;
    }

    status = Cy_Crypto_Core_V2_Aes_Ccm_Start(base, dirMode, ivSize, iv, aesCcmState);

    if (CY_CRYPTO_SUCCESS != status)
    {
        return status;
    }

    status = Cy_Crypto_Core_V2_Aes_Ccm_Update_Aad(base, aadSize, aad, aesCcmState);

    if (CY_CRYPTO_SUCCESS != status)
    {
        return status;
    }

    status = Cy_Crypto_Core_V2_Aes_Ccm_Update(base, srcSize, dst, src, aesCcmState);

    if (CY_CRYPTO_SUCCESS != status)
    {
        return status;
    }

    status = Cy_Crypto_Core_V2_Aes_Ccm_Finish(base, tag, aesCcmState);

    return status;
}




/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_Ccm_Encrypt_Tag
****************************************************************************//*
*
* Performs an AES CCM Encrypt operation.
* \note Cy_Crypto_Core_V2_Aes_Ccm_Init() and Cy_Crypto_Core_V2_Aes_Ccm_SetKey() should be called before calling this function
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param ivSize
* The size of the IV.
*
* \param iv
* The pointer to the IV.
*
* \param aadSize
* The size of the AAD.
*
* \param aad
* The pointer to a AAD.
*
* \param srcSize
* The size of the source block.
*
* \param cipherTxt
* The pointer to a cipher text block.
*
* \param plainTxt
* The pointer to a plain text block.
*
* \param tagSize
* The size of the Tag.
*
* \param tag
* The pointer to the tags.
*
* \param aesCcmState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_Ccm_Encrypt_Tag(CRYPTO_Type *base,
        uint32_t ivSize, uint8_t const * iv,
        uint32_t aadSize, uint8_t const *aad,
        uint32_t srcSize, uint8_t *cipherTxt, uint8_t const *plainTxt,
        uint32_t tagSize, uint8_t *tag,
        cy_stc_crypto_aes_ccm_state_t *aesCcmState)

{

    return Cy_Crypto_Core_V2_Aes_Ccm(base, CY_CRYPTO_ENCRYPT, ivSize, iv, aadSize, aad,
                                     srcSize, cipherTxt, plainTxt, tagSize, tag,
                                     aesCcmState);
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_Ccm_Decrypt
****************************************************************************//*
*
* Performs an AES CCM Decrypt operation.
* \note Cy_Crypto_Core_V2_Aes_Ccm_Init() and Cy_Crypto_Core_V2_Aes_Ccm_SetKey() should be called before calling this function
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param ivSize
* The size of the IV.
*
* \param iv
* The pointer to the IV.
*
* \param aadSize
* The size of the AAD.
*
* \param aad
* The pointer to a AAD.
*
* \param srcSize
* The size of the source block.
*
* \param plainTxt
* The pointer to a plain text block.
*
* \param cipherTxt
* The pointer to a cipher text block.
*
* \param tagSize
* The size of the Tag.
*
* \param tag
* The pointer to the tags.
*
* \param isValid
* The pointer Store the authentication status.
*
* \param aesCcmState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_Ccm_Decrypt(CRYPTO_Type *base,
        uint32_t ivSize, uint8_t const * iv,
        uint32_t aadSize, uint8_t const *aad,
        uint32_t srcSize, uint8_t *plainTxt, uint8_t const *cipherTxt,
        uint32_t tagSize, uint8_t const *tag, cy_en_crypto_aesccm_tag_verify_result_t *isValid,
        cy_stc_crypto_aes_ccm_state_t *aesCcmState)

{
    cy_en_crypto_status_t status = CY_CRYPTO_BAD_PARAMS;
    uint8_t TagCal_t[CY_CRYPTO_ALIGN_CACHE_LINE(CY_CRYPTO_AES_BLOCK_SIZE) + CY_CRYPTO_DCAHCE_PADDING_SIZE] = {0u};
    uint8_t *TagCal = (uint8_t*)CY_CRYPTO_DCACHE_ALIGN_ADDRESS(TagCal_t);
    *isValid = CY_CRYPTO_CCM_TAG_INVALID;

    status = Cy_Crypto_Core_V2_Aes_Ccm(base, CY_CRYPTO_DECRYPT, ivSize, iv, aadSize, aad,
                                       srcSize, (uint8_t *)plainTxt, cipherTxt, tagSize, TagCal,
                                       aesCcmState);
    if (CY_CRYPTO_SUCCESS != status)
    {
        return status;
    }

    if (Cy_Crypto_Core_V2_MemCmp(base, tag, TagCal, (uint16_t)tagSize) == 0u)
    {
        *isValid = CY_CRYPTO_CCM_TAG_VALID;
    }

