PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_aes_v2.c
cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_GCM_Init(CRYPTO_Type *base, cy_stc_crypto_aes_gcm_buffers_t *aesGCMBuffers, cy_stc_crypto_aes_gcm_state_t* aesGCMctx)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;
    cy_stc_crypto_aes_gcm_buffers_t *aesGCMBuffersRemap;
    if ((NULL != base) && (NULL != aesGCMBuffers) && (NULL != aesGCMctx))
    {
        aesGCMBuffersRemap = (cy_stc_crypto_aes_gcm_buffers_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesGCMBuffers);

        Cy_Crypto_Core_V2_MemSet(base, aesGCMctx, 0U, (uint16_t)sizeof(cy_stc_crypto_aes_gcm_state_t));
        Cy_Crypto_Core_V2_MemSet(base, aesGCMBuffersRemap, 0U, (uint16_t)sizeof(cy_stc_crypto_aes_gcm_buffers_t));

        aesGCMctx->h = aesGCMBuffers->h;
        aesGCMctx->icb = aesGCMBuffers->icb;
        aesGCMctx->cb = aesGCMBuffers->cb;
        aesGCMctx->y = aesGCMBuffers->y;
        aesGCMctx->temp = aesGCMBuffers->temp;
        aesGCMctx->aes_data = aesGCMBuffers->aes_data;
        aesGCMctx->aes_buffer = &aesGCMBuffers->aes_buffer;

        tmpResult = CY_CRYPTO_SUCCESS;
    }

    return tmpResult;
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_GCM_Setkey
****************************************************************************//**
*
* The function to set AES GCM Key.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param aes_key
* The pointer to the AES key.
*
* \param keyLength
* \ref cy_en_crypto_aes_key_length_t
*
* \param aesGCMctx
* The pointer to the AES GCM structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*******************************************************************************/

cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_GCM_SetKey(CRYPTO_Type *base, uint8_t const *aesKey, cy_en_crypto_aes_key_length_t keyLength, cy_stc_crypto_aes_gcm_state_t* aesGCMctx)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;
    uint8_t *keyRemap;
    uint8_t *hRemap;
    cy_stc_crypto_aes_buffers_t *aesBuffersRemap;

    if ((NULL != base) && (NULL != aesKey) && (NULL != aesGCMctx) && (NULL != aesGCMctx->aes_buffer))
    {
#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
        /* Flush the cache */
        SCB_CleanDCache_by_Addr((volatile void *)aesKey, (int32_t)((int32_t)CY_CRYPTO_AES_128_KEY_SIZE + ((int32_t)8 * (int32_t)keyLength)));
#endif

        keyRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesKey);
        hRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesGCMctx->h);
        aesBuffersRemap = (cy_stc_crypto_aes_buffers_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesGCMctx->aes_buffer);

        tmpResult = Cy_Crypto_Core_V2_Aes_Init(base, keyRemap, keyLength, &aesGCMctx->aesState, aesBuffersRemap);

        if (CY_CRYPTO_SUCCESS == tmpResult)
        {
            Cy_Crypto_Core_V2_MemSet(base, hRemap, 0u, CY_CRYPTO_AES_BLOCK_SIZE);
            tmpResult = Cy_Crypto_Core_V2_Aes_Ecb(base, CY_CRYPTO_ENCRYPT, hRemap, hRemap, &aesGCMctx->aesState);
        }
    }

    return tmpResult;
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_GCM_Start
****************************************************************************//**
*
* The function to Start AES GCM operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param mode
* mode of operation encrypt/decrypt
*
* \param iv
* The pointer to the Initialization vector.
*
* \param ivSize
* The length of the iv.
*
* \param aesGCMctx
* The pointer to the AES GCM structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*******************************************************************************/

cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_GCM_Start(CRYPTO_Type *base, cy_en_crypto_dir_mode_t mode, uint8_t const *iv, uint32_t ivSize, cy_stc_crypto_aes_gcm_state_t* aesGCMctx)
{
#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    uint8_t ivBitlen_t[CY_CRYPTO_ALIGN_CACHE_LINE(sizeof(uint64_t)) + CY_CRYPTO_DCAHCE_PADDING_SIZE];
    uint64_t *ivBitlen = (uint64_t *)CY_CRYPTO_DCACHE_ALIGN_ADDRESS(ivBitlen_t);
    uint8_t temp_t[CY_CRYPTO_ALIGN_CACHE_LINE(CY_CRYPTO_AES_BLOCK_SIZE) + CY_CRYPTO_DCAHCE_PADDING_SIZE] = {0u};
    uint8_t *temp = (uint8_t *)CY_CRYPTO_DCACHE_ALIGN_ADDRESS(temp_t);
#else
    uint64_t ivBitlen_t;
    uint64_t *ivBitlen = &ivBitlen_t;
    uint8_t temp[CY_CRYPTO_AES_BLOCK_SIZE] = {0u};
#endif
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;
    uint8_t *ivRemap;
    uint8_t *icbRemap;
    uint8_t *yRemap;
    uint8_t *tempRemap;
    uint8_t *hRemap;
    uint8_t *cbRemap;

    if ((NULL != base) && ((NULL != iv) && ivSize > 0U) && (NULL != aesGCMctx) && (NULL != aesGCMctx->aes_buffer))
    {

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
        /* Flush the cache */
        SCB_CleanDCache_by_Addr((volatile void *)iv, (int32_t)ivSize);
#endif

        ivRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(iv);
        icbRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesGCMctx->icb);
        yRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesGCMctx->y);
        tempRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesGCMctx->temp);
        hRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesGCMctx->h);
        cbRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesGCMctx->cb);

        aesGCMctx->mode = mode;
        Cy_Crypto_Core_V2_MemSet(base, icbRemap, 0u, CY_CRYPTO_AES_BLOCK_SIZE);
        Cy_Crypto_Core_V2_MemSet(base, yRemap, 0u, CY_CRYPTO_AES_BLOCK_SIZE);
        Cy_Crypto_Core_V2_MemSet(base, tempRemap, 0u, CY_CRYPTO_AES_BLOCK_SIZE);

        aesGCMctx->data_size = 0u;
        aesGCMctx->aad_size = 0u;
        aesGCMctx->partial_aad_processed = false;

        if (CY_CRYPTO_AES_GCM_IV_SIZE == ivSize)
        {
            Cy_Crypto_Core_V2_MemCpy(base, (void*)icbRemap, (void*)ivRemap, (uint16_t)ivSize);
            aesGCMctx->icb[15U] = 1U;
#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
            /* Flush the cache */
            SCB_CleanDCache_by_Addr((volatile void *)aesGCMctx->icb, (int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
#endif
            __DSB();

