PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_aes_v2.c
                if (CY_CRYPTO_ENCRYPT == aesGCMctx->mode)
                {
                    output[index] = temp[i];
                    aesGCMctx->aes_data[i] = output[index];
                }
                else
                {
                    aesGCMctx->aes_data[i] = input[index];
                    output[index] = temp[i];
                }

                index++;
            }

            inputSize -= process_size - aesGCMctx->data_size % CY_CRYPTO_AES_BLOCK_SIZE;
            aesGCMctx->data_size += process_size - aesGCMctx->data_size % CY_CRYPTO_AES_BLOCK_SIZE;

            if (aesGCMctx->data_size % CY_CRYPTO_AES_BLOCK_SIZE == 0u)
            {
                Cy_Crypto_Core_V2_Aes_GCM_Ghash(base, hRemap, aesdataRemap, CY_CRYPTO_AES_BLOCK_SIZE, yRemap);
            }

        }
        tmpResult = CY_CRYPTO_SUCCESS;
    }

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    SCB_InvalidateDCache_by_Addr(output, (int32_t)inputSize);
#endif

    return tmpResult;
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_GCM_tag
****************************************************************************//**
*
* The function to calculate the tag.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param p_tag
* The pointer to the buffer for storing tag.
*
* \param tagSize
*  The length of the p_tag.
*
*
* \param aesGCMctx
* The pointer to the AES aesGCMctx structure allocated by the user. The user
* must not modify anything in this structure.
*******************************************************************************/
static void Cy_Crypto_Core_V2_Aes_GCM_tag(CRYPTO_Type *base,  uint8_t *p_tag,   uint32_t tagSize, cy_stc_crypto_aes_gcm_state_t* aesGCMctx)
{
#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    uint8_t bitlen_t[CY_CRYPTO_ALIGN_CACHE_LINE(sizeof(uint64_t)) + CY_CRYPTO_DCAHCE_PADDING_SIZE];
    uint64_t *bitlen = (uint64_t *)CY_CRYPTO_DCACHE_ALIGN_ADDRESS(bitlen_t);
    uint8_t aadbitlen_t[CY_CRYPTO_ALIGN_CACHE_LINE(sizeof(uint64_t)) + CY_CRYPTO_DCAHCE_PADDING_SIZE];
    uint64_t *aadbitlen = (uint64_t *)CY_CRYPTO_DCACHE_ALIGN_ADDRESS(aadbitlen_t);
    uint8_t temp_data_t[CY_CRYPTO_ALIGN_CACHE_LINE(CY_CRYPTO_AES_BLOCK_SIZE) + CY_CRYPTO_DCAHCE_PADDING_SIZE] = {0u};
    uint8_t *temp_data = (uint8_t *)CY_CRYPTO_DCACHE_ALIGN_ADDRESS(temp_data_t);
#else
    uint8_t temp_data[CY_CRYPTO_AES_BLOCK_SIZE] = {0};
    uint64_t bitlen_t;
    uint64_t aadbitlen_t;
    uint64_t *bitlen = &bitlen_t;
    uint64_t *aadbitlen = &aadbitlen_t;
#endif
    uint32_t i = 0;
    uint8_t *tempRemap ;
    uint8_t *hRemap;
    uint8_t *yRemap;
    uint8_t *icbRemap;

    bitlen[0] = (uint64_t)aesGCMctx->data_size << 3U; // Bytes to bits
    aadbitlen[0] = (uint64_t)aesGCMctx->aad_size << 3U; // Bytes to bits

    tempRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(&temp_data[0u]);
    hRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesGCMctx->h);
    yRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesGCMctx->y);
    icbRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesGCMctx->icb);


    bitlen[0] = CY_SWAP_ENDIAN64(bitlen[0]);
    aadbitlen[0] = CY_SWAP_ENDIAN64(aadbitlen[0]);

    __DSB();

    Cy_Crypto_Core_V2_MemCpy(base, (void*)tempRemap, (void*)aadbitlen, (uint16_t)sizeof(aadbitlen[0]));
    Cy_Crypto_Core_V2_MemCpy(base, (void*)(tempRemap + 8u), (void*)bitlen, (uint16_t)sizeof(bitlen[0]));

    Cy_Crypto_Core_V2_Aes_GCM_Ghash(base, hRemap, tempRemap, CY_CRYPTO_AES_BLOCK_SIZE, yRemap);

    (void)Cy_Crypto_Core_V2_Aes_Ecb(base, CY_CRYPTO_ENCRYPT, tempRemap, icbRemap, &aesGCMctx->aesState);

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    SCB_InvalidateDCache_by_Addr(temp_data, (int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
#endif

    for (i = 0u; i < tagSize; i++)
    {
        p_tag[i] = aesGCMctx->y[i] ^ temp_data[i];
    }
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_GCM_Finish
****************************************************************************//**
*
* The function to finish the AES GCM operation and to calculates the tag.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param p_tag
* The pointer to the buffer for storing tag.
*
* \param tagSize
*  The length of the p_tag.
*
* \param aesGCMctx
* The pointer to the AES aesGCMctx structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_GCM_Finish(CRYPTO_Type *base,  uint8_t *p_tag,  uint32_t tagSize, cy_stc_crypto_aes_gcm_state_t* aesGCMctx)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;
    uint8_t *hRemap;
    uint8_t *yRemap;
    uint8_t *tempRemap;
    uint8_t *aesdataRemap;

    if ((NULL != base) && (NULL != p_tag)  && !((tagSize > CY_CRYPTO_AES_BLOCK_SIZE) || (tagSize < 4u)) && (NULL != aesGCMctx))
    {

        hRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesGCMctx->h);
        yRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesGCMctx->y);
        tempRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesGCMctx->temp);
        aesdataRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesGCMctx->aes_data);

        if ((0u == aesGCMctx->data_size) && (0u != aesGCMctx->aad_size % CY_CRYPTO_AES_BLOCK_SIZE))
        {
            Cy_Crypto_Core_V2_Aes_GCM_Ghash(base, hRemap, tempRemap, aesGCMctx->aad_size % CY_CRYPTO_AES_BLOCK_SIZE, yRemap);
        }

        if (0u != aesGCMctx->data_size % CY_CRYPTO_AES_BLOCK_SIZE)
        {
            Cy_Crypto_Core_V2_Aes_GCM_Ghash(base, hRemap, aesdataRemap, aesGCMctx->data_size % CY_CRYPTO_AES_BLOCK_SIZE, yRemap);
        }

        Cy_Crypto_Core_V2_Aes_GCM_tag(base,  p_tag, tagSize, aesGCMctx);
        tmpResult = CY_CRYPTO_SUCCESS;
    }

    return  tmpResult;
}


