PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_aes_v2.c
/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_GCM_Encrypt_Tag
****************************************************************************//**
*
* The function performs the AES GCM encryption and generates the TAG
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param aes_key
* The pointer to the AES key.
*
* \param keyLength
* \ref cy_en_crypto_aes_key_length_t
*
* \param iv
* The pointer to the Initialization vector.
*
* \param ivSize
* The length of the iv.
*
* \param aad
* The pointer to the Additional Authentication Data.
*
* \param aadSize
*  The length of the additional Authentication Data
*
* \param input
* The pointer to the input data to be encrypted/decrypted.
*
* \param inputSize
*  The length of the input data.
*
* \param output
* The pointer to the encrypted/decrypted output data.
*
* \param tag
* The pointer to the tag.
*
* \param tagSize
*  The length of the p_tag.
*
* \return
* \ref cy_en_crypto_status_t
*******************************************************************************/

cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_GCM_Encrypt_Tag(CRYPTO_Type *base, uint8_t const *aesKey, cy_en_crypto_aes_key_length_t keyLength,
        uint8_t const *iv, uint32_t ivSize, uint8_t *aad,   uint32_t aadSize,
        uint8_t const *input,   uint32_t inputSize,  uint8_t *output, uint8_t *tag, uint32_t tagSize)

{

    cy_en_crypto_status_t status = CY_CRYPTO_BAD_PARAMS;
    uint8_t aesGCMctx_t[CY_CRYPTO_ALIGN_CACHE_LINE(sizeof(cy_stc_crypto_aes_gcm_state_t)) + CY_CRYPTO_DCAHCE_PADDING_SIZE];
    uint8_t aesGCMBuffers_t[CY_CRYPTO_ALIGN_CACHE_LINE(sizeof(cy_stc_crypto_aes_gcm_buffers_t)) + CY_CRYPTO_DCAHCE_PADDING_SIZE];

    cy_stc_crypto_aes_gcm_state_t  *aesGCMctx = (cy_stc_crypto_aes_gcm_state_t*) CY_CRYPTO_DCACHE_ALIGN_ADDRESS(aesGCMctx_t);
    cy_stc_crypto_aes_gcm_buffers_t *aesGCMBuffers = (cy_stc_crypto_aes_gcm_buffers_t*) CY_CRYPTO_DCACHE_ALIGN_ADDRESS(aesGCMBuffers_t);

    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesKey) || ((NULL == iv) && (ivSize > 0u))
            || (((NULL == input) || (NULL == output)) && (inputSize > 0u)))
    {
        return status;
    }

    Cy_Crypto_Core_V2_MemSet(base, (void*)aesGCMctx, 0x00U, (uint16_t)sizeof(cy_stc_crypto_aes_gcm_state_t));
    Cy_Crypto_Core_V2_MemSet(base, (void*)aesGCMBuffers, 0x00U, (uint16_t)sizeof(cy_stc_crypto_aes_gcm_buffers_t));

    status = Cy_Crypto_Core_V2_Aes_GCM_Init(base, aesGCMBuffers, aesGCMctx);

    if (CY_CRYPTO_SUCCESS == status)
    {
        status = Cy_Crypto_Core_V2_Aes_GCM_SetKey(base, aesKey, keyLength, aesGCMctx);
    }

    if (CY_CRYPTO_SUCCESS == status)
    {
        status = Cy_Crypto_Core_V2_Aes_GCM_Start(base, CY_CRYPTO_ENCRYPT, iv, ivSize, aesGCMctx);
    }

    if (CY_CRYPTO_SUCCESS == status)
    {
        status = Cy_Crypto_Core_V2_Aes_GCM_AAD_Update(base, aad, aadSize, aesGCMctx);
    }

    if (CY_CRYPTO_SUCCESS == status)
    {
        status = Cy_Crypto_Core_V2_Aes_GCM_Update(base, input, inputSize, output, aesGCMctx);
    }

    if (CY_CRYPTO_SUCCESS == status)
    {
        status =  Cy_Crypto_Core_V2_Aes_GCM_Finish(base, tag, tagSize, aesGCMctx);
    }

    if (CY_CRYPTO_SUCCESS == status)
    {
        status =  Cy_Crypto_Core_V2_Aes_GCM_Free(base, aesGCMctx);
    }

    return (status);
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_GCM_Decrypt_Tag
****************************************************************************//**
*
* The function performs the AES GCM decryption and verifies the TAG.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param aes_key
* The pointer to the AES key.
*
* \param keyLength
* \ref cy_en_crypto_aes_key_length_t
*
* \param iv
* The pointer to the Initialization vector.
*
* \param ivSize
* The length of the iv.
*
* \param aad
* The pointer to the Additional Authentication Data.
*
* \param aadSize
*  The length of the additional Authentication Data
*
* \param input
* The pointer to the input data to be encrypted/decrypted.
*
* \param inputSize
*  The length of the input data.
*
* \param output
* The pointer to the encrypted/decrypted output data.
*
* \param tag
* The pointer to the tag.
*
* \param tagSize
*  The length of the p_tag.
*
* \param isVerified
* The status of the AES GCM verification.
*
* \return
* \ref cy_en_crypto_status_t
*******************************************************************************/

cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_GCM_Decrypt_Tag(CRYPTO_Type *base, uint8_t const *aesKey, cy_en_crypto_aes_key_length_t keyLength,
        uint8_t const *iv, uint32_t ivSize, uint8_t *aad,   uint32_t aadSize,
        uint8_t const *input,   uint32_t inputSize, uint8_t *tag, uint32_t tagSize, uint8_t *output, cy_en_crypto_aesgcm_tag_verify_result_t *isVerified)

{
    cy_en_crypto_status_t status = CY_CRYPTO_BAD_PARAMS;
    uint8_t expected_tag_t[CY_CRYPTO_ALIGN_CACHE_LINE(CY_CRYPTO_AES_BLOCK_SIZE) + CY_CRYPTO_DCAHCE_PADDING_SIZE] = {0};
    uint8_t *expected_tag = (uint8_t *)CY_CRYPTO_DCACHE_ALIGN_ADDRESS(expected_tag_t);
    *isVerified  = CY_CRYPTO_TAG_INVALID;

    uint8_t aesGCMctx_t[CY_CRYPTO_ALIGN_CACHE_LINE(sizeof(cy_stc_crypto_aes_gcm_state_t)) + CY_CRYPTO_DCAHCE_PADDING_SIZE];
    uint8_t aesGCMBuffers_t[CY_CRYPTO_ALIGN_CACHE_LINE(sizeof(cy_stc_crypto_aes_gcm_buffers_t)) + CY_CRYPTO_DCAHCE_PADDING_SIZE];

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    cy_stc_crypto_aes_gcm_state_t  *aesGCMctx = (cy_stc_crypto_aes_gcm_state_t*) CY_CRYPTO_DCACHE_ALIGN_ADDRESS(aesGCMctx_t);
    cy_stc_crypto_aes_gcm_buffers_t *aesGCMBuffers = (cy_stc_crypto_aes_gcm_buffers_t*) CY_CRYPTO_DCACHE_ALIGN_ADDRESS(aesGCMBuffers_t);
#else
    cy_stc_crypto_aes_gcm_state_t *aesGCMctx = (cy_stc_crypto_aes_gcm_state_t *)&aesGCMctx_t;
    cy_stc_crypto_aes_gcm_buffers_t *aesGCMBuffers = (cy_stc_crypto_aes_gcm_buffers_t*)&aesGCMBuffers_t;
#endif

    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesKey) || ((NULL == iv) && (ivSize > 0u))
            || (((NULL == input) || (NULL == output)) && (inputSize > 0u)))
    {
        return status;
    }

