PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_aes_v2.c
    Cy_Crypto_Core_V2_MemSet(base, (void*)aesGCMctx, 0x00U, (uint16_t)sizeof(cy_stc_crypto_aes_gcm_state_t));
    Cy_Crypto_Core_V2_MemSet(base, (void*)aesGCMBuffers, 0x00U, (uint16_t)sizeof(cy_stc_crypto_aes_gcm_buffers_t));

    status = Cy_Crypto_Core_V2_Aes_GCM_Init(base, aesGCMBuffers, aesGCMctx);

    if (CY_CRYPTO_SUCCESS == status)
    {
        status = Cy_Crypto_Core_V2_Aes_GCM_SetKey(base, aesKey, keyLength, aesGCMctx);
    }

    if (CY_CRYPTO_SUCCESS == status)
    {
        status = Cy_Crypto_Core_V2_Aes_GCM_Start(base, CY_CRYPTO_DECRYPT, iv, ivSize, aesGCMctx);
    }

    if (CY_CRYPTO_SUCCESS == status)
    {
        status = Cy_Crypto_Core_V2_Aes_GCM_AAD_Update(base, aad, aadSize, aesGCMctx);
    }

    if (CY_CRYPTO_SUCCESS == status)
    {
        status = Cy_Crypto_Core_V2_Aes_GCM_Update(base, input, inputSize, output, aesGCMctx);
    }

    if (CY_CRYPTO_SUCCESS == status)
    {
        status =  Cy_Crypto_Core_V2_Aes_GCM_Finish(base, expected_tag, tagSize, aesGCMctx);
    }

    if (CY_CRYPTO_SUCCESS == status)
    {
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.3', 'from essential type "unsigned 32-bit int" to different or narrower essential type "unsigned 16-bit int');
        if (Cy_Crypto_Core_V2_MemCmp(base, tag, expected_tag, tagSize) == 0U)
        {
            *isVerified = CY_CRYPTO_TAG_VALID;
        }
    }

    if (CY_CRYPTO_SUCCESS == status)
    {
        status =  Cy_Crypto_Core_V2_Aes_GCM_Free(base, aesGCMctx);
    }

    return (status);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_GCM_Free
****************************************************************************//**
*
* The function to finish the encryption process and calculate tag.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param aesGCMctx
* The pointer to the AES aesGCMctx structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_GCM_Free(CRYPTO_Type *base,  cy_stc_crypto_aes_gcm_state_t* aesGCMctx)
{
    if ((NULL != base) && (NULL != aesGCMctx))
    {
        if (NULL != aesGCMctx->aes_buffer)
        {
            Cy_Crypto_Core_V2_MemSet(base, (void*)aesGCMctx->aes_buffer, 0U, (uint16_t)sizeof(cy_stc_crypto_aes_buffers_t));
        }

        if (NULL != aesGCMctx->h)
        {
            Cy_Crypto_Core_V2_MemSet(base, (void*)aesGCMctx->h, 0U, CY_CRYPTO_AES_BLOCK_SIZE);
        }

        if (NULL != aesGCMctx->icb)
        {
            Cy_Crypto_Core_V2_MemSet(base, (void*)aesGCMctx->icb, 0U, CY_CRYPTO_AES_BLOCK_SIZE);
        }

        if (NULL != aesGCMctx->cb)
        {
            Cy_Crypto_Core_V2_MemSet(base, (void*)aesGCMctx->cb, 0U, CY_CRYPTO_AES_BLOCK_SIZE);
        }

        if (NULL != aesGCMctx->y)
        {
            Cy_Crypto_Core_V2_MemSet(base, (void*)aesGCMctx->y, 0U, CY_CRYPTO_AES_BLOCK_SIZE);
        }

        if (NULL != aesGCMctx->temp)
        {
            Cy_Crypto_Core_V2_MemSet(base, (void*)aesGCMctx->temp, 0U, CY_CRYPTO_AES_BLOCK_SIZE);
        }

        if (NULL != aesGCMctx->aes_data)
        {
            Cy_Crypto_Core_V2_MemSet(base, (void*)aesGCMctx->aes_data, 0U, CY_CRYPTO_AES_BLOCK_SIZE);
        }

        Cy_Crypto_Core_V2_MemSet(base, (void*)aesGCMctx, 0U, (uint16_t)sizeof(cy_stc_crypto_aes_gcm_state_t));

    }

    return CY_CRYPTO_SUCCESS;
}
#endif /* (CPUSS_CRYPTO_GCM == 1) && defined(CY_CRYPTO_CFG_GCM_C)*/

/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_LoadEncKey
****************************************************************************//**
*
* Calculates an inverse block cipher key from the block cipher key.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
*******************************************************************************/
void Cy_Crypto_Core_V2_Aes_LoadEncKey(CRYPTO_Type *base,
                                      cy_stc_crypto_aes_state_t const *aesState)
{

    uint8_t *keyRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesState->buffers->key);

    /* Set the key mode: 128, 192 or 256 Bit */
    uint32_t keySize = CY_CRYPTO_AES_128_KEY_SIZE + ((uint32_t)aesState->keyLength * 8u);

    Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD0, keyRemap, keySize);
    Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_KEY0, CY_CRYPTO_V2_RB_FF_LOAD0, CY_CRYPTO_AES_128_KEY_SIZE);

    keySize -= CY_CRYPTO_AES_128_KEY_SIZE;

    if (keySize != 0u)
    {
        Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_KEY1, CY_CRYPTO_V2_RB_FF_LOAD0, keySize);
    }

    REG_CRYPTO_AES_CTL(base) = (uint32_t)(_VAL2FLD(CRYPTO_AES_CTL_KEY_SIZE, aesState->keyLength));

    Cy_Crypto_Core_WaitForReady(base);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_LoadDecKey
****************************************************************************//**
*
* Calculates an inverse block cipher key from the block cipher key.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
*******************************************************************************/
void Cy_Crypto_Core_V2_Aes_LoadDecKey(CRYPTO_Type *base,
                                      cy_stc_crypto_aes_state_t const  *aesState)
{

    /* Issue the AES_KEY instruction to prepare the key for decrypt operation */
    uint32_t keySize = CY_CRYPTO_AES_128_KEY_SIZE + ((uint32_t)aesState->keyLength * 8u);

    Cy_Crypto_Core_V2_Aes_LoadEncKey(base, aesState);

    Cy_Crypto_Core_V2_RunAes(base);             /* dummy encryption */

    Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_KEY0, CY_CRYPTO_V2_RB_KEY2, CY_CRYPTO_AES_128_KEY_SIZE);

    keySize -= CY_CRYPTO_AES_128_KEY_SIZE;

