PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_aes_v2.c
    cy_en_crypto_status_t status = CY_CRYPTO_BAD_PARAMS;
    uint32_t bytes_to_copy = 0u;
    uint32_t cnt = 0u;
#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    uint8_t tempbuf[CY_CRYPTO_ALIGN_CACHE_LINE(CY_CRYPTO_AES_BLOCK_SIZE) + CY_CRYPTO_DCAHCE_PADDING_SIZE] = {0u};
    uint8_t *temp = (uint8_t*)CY_CRYPTO_DCACHE_ALIGN_ADDRESS(tempbuf);
    uint8_t *srcRemap;
#else
    uint8_t temp[CY_CRYPTO_AES_BLOCK_SIZE] = {0u};
    uint8_t *srcRemap;
#endif

    if (0u == srcSize)
    {
        return CY_CRYPTO_SUCCESS;
    }

    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState) || (NULL == src))
    {
        return CY_CRYPTO_BAD_PARAMS;
    }

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    /* Flush the cache */
    SCB_CleanDCache_by_Addr((volatile void *)src, (int32_t)srcSize);
#endif

    srcRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(src);

    if (aesState->unProcessedBytes + srcSize < CY_CRYPTO_AES_BLOCK_SIZE)
    {
#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
        SCB_CleanDCache_by_Addr((volatile void *)aesState->buffers->unProcessedData, (int32_t)srcSize);
#endif

        Cy_Crypto_Core_V2_MemCpy(base, (void*)&aesState->buffers->unProcessedData[aesState->unProcessedBytes], (void*)srcRemap, (uint16_t)srcSize);

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
        SCB_InvalidateDCache_by_Addr((volatile void *)aesState->buffers->unProcessedData, (int32_t)srcSize);
#endif

        aesState->unProcessedBytes += srcSize;
        status = CY_CRYPTO_SUCCESS;
    }
    else
    {

        if (aesState->unProcessedBytes > 0u)
        {

            bytes_to_copy = CY_CRYPTO_AES_BLOCK_SIZE - aesState->unProcessedBytes;

            if (srcSize < bytes_to_copy)
            {
                bytes_to_copy = srcSize;
            }

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
            SCB_CleanDCache_by_Addr((volatile void *)aesState->buffers->unProcessedData, (int32_t)bytes_to_copy);
#endif

            Cy_Crypto_Core_V2_MemCpy(base, (void*)&aesState->buffers->unProcessedData[aesState->unProcessedBytes], (void*)srcRemap, (uint16_t)bytes_to_copy);

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
            SCB_InvalidateDCache_by_Addr((volatile void *)aesState->buffers->unProcessedData, (int32_t)bytes_to_copy);
#endif

            status = Cy_Crypto_Core_V2_Aes_Cbc(base, CY_CRYPTO_ENCRYPT, CY_CRYPTO_AES_BLOCK_SIZE, aesState->buffers->iv, temp, aesState->buffers->unProcessedData, aesState);
            if (CY_CRYPTO_SUCCESS != status)
            {
                return status;
            }

            srcSize -= bytes_to_copy;
            srcRemap += bytes_to_copy;
            aesState->unProcessedBytes = 0u;
        }

        cnt = (uint32_t)(srcSize / CY_CRYPTO_AES_BLOCK_SIZE);

        while (cnt != 0u)
        {
            status = Cy_Crypto_Core_V2_Aes_Cbc(base, CY_CRYPTO_ENCRYPT, CY_CRYPTO_AES_BLOCK_SIZE, aesState->buffers->iv, temp, srcRemap, aesState);

            if (CY_CRYPTO_SUCCESS != status)
            {
                return status;
            }

            srcRemap +=  CY_CRYPTO_AES_BLOCK_SIZE;
            srcSize -= CY_CRYPTO_AES_BLOCK_SIZE;
            cnt--;
        }

        if (srcSize > 0u)
        {
            Cy_Crypto_Core_V2_MemCpy(base, aesState->buffers->unProcessedData, (void*)srcRemap, (uint16_t)srcSize);
            aesState->unProcessedBytes = srcSize;
        }
    }

    return status;
}



/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_CbcMac_Finish
****************************************************************************//**
*
* Performs an AES CBC finish operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param mac
* The pointer to a cbc-mac.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_CbcMac_Finish(CRYPTO_Type *base, uint8_t *mac, cy_stc_crypto_aes_state_t *aesState)
{
    uint8_t *macRemap;

    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState) || (NULL == mac))
    {
        return CY_CRYPTO_BAD_PARAMS;
    }

    if (aesState->unProcessedBytes > 0u)
    {
        return CY_CRYPTO_BAD_PARAMS;
    }

    macRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(mac);

    Cy_Crypto_Core_V2_MemCpy(base, macRemap, (void*)&aesState->buffers->iv, (uint16_t)CY_CRYPTO_AES_BLOCK_SIZE);

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    SCB_InvalidateDCache_by_Addr(mac, (int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
#endif

    return CY_CRYPTO_SUCCESS;
}
#endif /* defined(CY_CRYPTO_CFG_CBC_MAC_C) */

#endif /* defined(CY_CRYPTO_CFG_CIPHER_MODE_CBC) */

#if defined(CY_CRYPTO_CFG_CIPHER_MODE_CFB)
/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_Cfb
********************************************************************************
*
* Performs AES operation on a plain text with the Cipher Feedback Block method (CFB).
*
* When D-Cache is enabled parameters ivPtr, dst and src must align and end in 32 byte boundary.
* When DCache disabled, src must be 4-Byte aligned.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param dirMode
* Can be \ref CY_CRYPTO_ENCRYPT or \ref CY_CRYPTO_DECRYPT
* (\ref cy_en_crypto_dir_mode_t)
*
* \param srcSize
* The size of the source plain text.
*
* \param ivPtr
* The pointer to the initial vector.
*
* \param dst
* The pointer to a destination cipher text.
*
* \param src
* The pointer to a source plain text.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_Cfb(CRYPTO_Type *base,
        cy_en_crypto_dir_mode_t dirMode,
        uint32_t srcSize,
        uint8_t *ivPtr,
        uint8_t *dst,
        uint8_t const *src,
        cy_stc_crypto_aes_state_t *aesState)
{
    uint32_t size = srcSize;

    cy_en_crypto_status_t tmpResult = CY_CRYPTO_SIZE_NOT_X16;
    uint8_t *ivRemap;
    uint8_t *dstRemap;
    uint8_t *srcRemap;

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    /* Flush the cache */
    SCB_CleanDCache_by_Addr((volatile void *)ivPtr, (int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
    SCB_CleanDCache_by_Addr((volatile void *)src, (int32_t)srcSize);
#endif

    /* Check whether the data size is multiple of CY_CRYPTO_AES_BLOCK_SIZE */
    if (0UL == (size & ((uint32_t)CY_CRYPTO_AES_BLOCK_SIZE - 1UL)))
    {

