PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_aes_v2.c
        ivRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(ivPtr);
        dstRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(dst);
        srcRemap = (uint8_t *) CY_REMAP_ADDRESS_FOR_CRYPTO(src);

        Cy_Crypto_Core_V2_Aes_LoadEncKey(base, aesState);

        /* Load the Initialization Vector to the src buffer */
        Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD1, ivRemap, CY_CRYPTO_AES_BLOCK_SIZE);
        Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_BLOCK0, CY_CRYPTO_V2_RB_FF_LOAD1, CY_CRYPTO_AES_BLOCK_SIZE);

        Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD0, srcRemap, size);
        Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_STORE, dstRemap, size);

        if (CY_CRYPTO_ENCRYPT == dirMode)
        {
            while (size != 0U)
            {
                Cy_Crypto_Core_V2_RunAes(base);
                Cy_Crypto_Core_V2_BlockXor(base, CY_CRYPTO_V2_RB_BLOCK0,
                                           CY_CRYPTO_V2_RB_FF_LOAD0, CY_CRYPTO_V2_RB_BLOCK1, CY_CRYPTO_AES_BLOCK_SIZE);
                Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_FF_STORE, CY_CRYPTO_V2_RB_BLOCK0, CY_CRYPTO_AES_BLOCK_SIZE);

                size -= CY_CRYPTO_AES_BLOCK_SIZE;
            }
        }
        else
        {
            while (size != 0U)
            {
                Cy_Crypto_Core_V2_RunAes(base);
                Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_BLOCK0, CY_CRYPTO_V2_RB_FF_LOAD0, CY_CRYPTO_AES_BLOCK_SIZE);
                Cy_Crypto_Core_V2_BlockXor(base, CY_CRYPTO_V2_RB_FF_STORE,
                                           CY_CRYPTO_V2_RB_BLOCK1, CY_CRYPTO_V2_RB_BLOCK0, CY_CRYPTO_AES_BLOCK_SIZE);

                size -= CY_CRYPTO_AES_BLOCK_SIZE;
            }
        }

        Cy_Crypto_Core_V2_Sync(base);

        /* Copy the local Initialization Vector to the external Initialization Vector */
        Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_STORE, ivRemap, CY_CRYPTO_AES_BLOCK_SIZE);
        Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_FF_STORE, CY_CRYPTO_V2_RB_BLOCK0, CY_CRYPTO_AES_BLOCK_SIZE);

        Cy_Crypto_Core_V2_Sync(base);

        tmpResult = CY_CRYPTO_SUCCESS;
#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
        SCB_InvalidateDCache_by_Addr(dst, (int32_t)srcSize);
#endif
    }


    return (tmpResult);
}



/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_Cfb_Setup
****************************************************************************//**
*
* Performs an AES CFB setup operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param dirMode
* Can be \ref CY_CRYPTO_ENCRYPT or \ref CY_CRYPTO_DECRYPT
* (\ref cy_en_crypto_dir_mode_t).
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_Cfb_Setup(CRYPTO_Type *base,
        cy_en_crypto_dir_mode_t dirMode,
        cy_stc_crypto_aes_state_t *aesState)
{
    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState) || (NULL == aesState->buffers))
    {
        return CY_CRYPTO_BAD_PARAMS;
    }

    aesState->dirMode = dirMode;
    aesState->unProcessedBytes = 0u;

    return CY_CRYPTO_SUCCESS;
}




/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_Cfb_Set_IV
****************************************************************************//**
*
* Sets IV for AES CFB mode.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param iv
* The pointer to iv.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_Cfb_Set_IV(CRYPTO_Type *base,
        uint8_t const * iv,
        cy_stc_crypto_aes_state_t *aesState)
{
    uint8_t *ivRemap;

    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState) || (NULL == iv))
    {
        return CY_CRYPTO_BAD_PARAMS;
    }

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    /* Flush the cache */
    SCB_CleanDCache_by_Addr((volatile void *)iv, (int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
#endif

    ivRemap = (uint8_t *) CY_REMAP_ADDRESS_FOR_CRYPTO(iv);

    Cy_Crypto_Core_V2_MemCpy(base, (void*)&aesState->buffers->iv, (void*)ivRemap, (uint16_t)CY_CRYPTO_AES_BLOCK_SIZE);

    return CY_CRYPTO_SUCCESS;
}




/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_Cfb_Update
****************************************************************************//**
*
* Performs an AES CFB Multistage update operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param srcSize
* The size of the source block.
*
* \param dst
* The pointer to a destination cipher block.
*
* \param src
* The pointer to a source block.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_Cfb_Update(CRYPTO_Type *base,
        uint32_t srcSize,
        uint8_t *dst,
        uint8_t const *src,
        cy_stc_crypto_aes_state_t *aesState)
{
    uint32_t bytes_rem = 0u;
    uint32_t cnt = 0u;
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_SIZE_NOT_X16;
    uint8_t *dstRemap;
    uint8_t *srcRemap;
    uint8_t *unprocessedRemap;
    uint8_t *ivRemap;

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    /* Flush the cache */
    SCB_CleanDCache_by_Addr((volatile void *)src, (int32_t)srcSize);
#endif

    dstRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(dst);
    srcRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(src);
    unprocessedRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesState->buffers->unProcessedData);
    ivRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesState->buffers->iv);

    if (aesState->unProcessedBytes != 0u)
    {
        bytes_rem = CY_CRYPTO_AES_BLOCK_SIZE - aesState->unProcessedBytes;
        Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD1, &unprocessedRemap[aesState->unProcessedBytes], bytes_rem);
        Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_BLOCK1, CY_CRYPTO_V2_RB_FF_LOAD1, bytes_rem);

        if (srcSize < bytes_rem)
        {
            bytes_rem = srcSize;
        }

        Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD0, srcRemap, bytes_rem);
        Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_STORE, dstRemap, bytes_rem);

        Cy_Crypto_Core_V2_BlockXor(base, CY_CRYPTO_V2_RB_BLOCK0, CY_CRYPTO_V2_RB_FF_LOAD0, CY_CRYPTO_V2_RB_BLOCK1, bytes_rem);
        Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_FF_STORE, CY_CRYPTO_V2_RB_BLOCK0, bytes_rem);

        if (aesState->dirMode == CY_CRYPTO_ENCRYPT)
        {
            Cy_Crypto_Core_V2_MemCpy(base, &ivRemap[aesState->unProcessedBytes], dstRemap, (uint16_t)bytes_rem);
        }
        else
        {
            Cy_Crypto_Core_V2_MemCpy(base, &ivRemap[aesState->unProcessedBytes], srcRemap, (uint16_t)bytes_rem);
        }

        aesState->unProcessedBytes += bytes_rem;
        srcSize -= bytes_rem;
        srcRemap += bytes_rem;
        dstRemap += bytes_rem;

        if (aesState->unProcessedBytes == CY_CRYPTO_AES_BLOCK_SIZE)
        {
            aesState->unProcessedBytes = 0;
        }

        tmpResult = CY_CRYPTO_SUCCESS;
    }

    cnt = (uint32_t)(srcSize / CY_CRYPTO_AES_BLOCK_SIZE);

    if (cnt != 0u)
    {
        tmpResult = Cy_Crypto_Core_V2_Aes_Cfb(CRYPTO, aesState->dirMode, cnt * CY_CRYPTO_AES_BLOCK_SIZE, aesState->buffers->iv, dstRemap, srcRemap, aesState);

        if (CY_CRYPTO_SUCCESS != tmpResult)
        {
            return tmpResult;
        }
        srcSize -= cnt * CY_CRYPTO_AES_BLOCK_SIZE;
        srcRemap += cnt * CY_CRYPTO_AES_BLOCK_SIZE;
        dstRemap += cnt * CY_CRYPTO_AES_BLOCK_SIZE;
    }

    if (srcSize > 0u)
    {
        Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD1, ivRemap, CY_CRYPTO_AES_BLOCK_SIZE);
        Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_BLOCK0, CY_CRYPTO_V2_RB_FF_LOAD1, CY_CRYPTO_AES_BLOCK_SIZE);

