PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_aes_v2.c
    Cy_Crypto_Core_V2_MemCpy(base, ivRemap, blockCounter, CY_CRYPTO_AES_BLOCK_SIZE);

    /* Save the reminder of the last non-complete block */
    *srcOffset = (uint32_t)(srcSize % CY_CRYPTO_AES_BLOCK_SIZE);
#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    SCB_InvalidateDCache_by_Addr(dst, (int32_t)srcSize);
#endif

    return (CY_CRYPTO_SUCCESS);
}



/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_Ctr_Setup
****************************************************************************//**
*
* Performs an AES CTR Multistage update operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_Ctr_Setup(CRYPTO_Type *base,
        cy_stc_crypto_aes_state_t *aesState)
{
    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState) || (NULL == aesState->buffers))
    {
        return CY_CRYPTO_BAD_PARAMS;
    }

    aesState->unProcessedBytes = 0u;
    return CY_CRYPTO_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_Ctr_Set_IV
****************************************************************************//**
*
* Sets IV for the AES CTR operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param iv
* The pointer to iv.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_Ctr_Set_IV(CRYPTO_Type *base,
        uint8_t const *iv,
        cy_stc_crypto_aes_state_t *aesState)
{
    uint8_t *ivRemap;

    /* Input parameters verification */
    if ((NULL == base) || (NULL == iv) || (NULL == aesState))
    {
        return CY_CRYPTO_BAD_PARAMS;
    }

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    /* Flush the cache */
    SCB_CleanDCache_by_Addr((volatile void *)iv, (int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
#endif

    ivRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(iv);

    Cy_Crypto_Core_V2_MemCpy(base, (void*)aesState->buffers->iv, (void*)ivRemap, (uint16_t)CY_CRYPTO_AES_BLOCK_SIZE);
    return CY_CRYPTO_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_Ctr_Update
****************************************************************************//**
*
* Performs an AES CTR Multistage update operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param srcSize
* The size of the source block.
*
* \param dst
* The pointer to a destination cipher block.
*
* \param src
* The pointer to a source block.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_Ctr_Update(CRYPTO_Type *base,
        uint32_t srcSize,
        uint8_t *dst,
        uint8_t const *src,
        cy_stc_crypto_aes_state_t *aesState)


{

    cy_en_crypto_status_t status = CY_CRYPTO_BAD_PARAMS;
    uint8_t *dstRemap;
    uint8_t *srcRemap;
    uint8_t *unprocessedRemap;

    if (0u == srcSize)
    {
        return CY_CRYPTO_SUCCESS;
    }

    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState) || (NULL == dst) || (NULL == src))
    {
        return CY_CRYPTO_BAD_PARAMS;
    }

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    /* Flush the cache */
    SCB_CleanDCache_by_Addr((volatile void *)src, (int32_t)srcSize);
    SCB_InvalidateDCache_by_Addr(aesState->buffers->iv, (int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
#endif

    dstRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(dst);
    srcRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(src);
    unprocessedRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesState->buffers->unProcessedData);

    uint32_t blockCount_t[CY_CRYPTO_ALIGN_CACHE_LINE_WORD(CY_CRYPTO_AES_BLOCK_SIZE_U32) + CY_CRYPTO_DCAHCE_PADDING_SIZE_WORD];
    uint32_t *blockCount = (uint32_t*)CY_CRYPTO_DCACHE_ALIGN_ADDRESS(blockCount_t);
    uint32_t *blockCounter = (uint32_t *) CY_REMAP_ADDRESS_FOR_CRYPTO(blockCount);
#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    uint16_t blockCount_size = (uint16_t)CY_CRYPTO_AES_BLOCK_SIZE;
#endif
    uint64_t counter;
    uint32_t cnt;
    uint32_t srcOffset;
    uint32_t bytes_rem;

    blockCount[ 0] = (uint32_t) CY_CRYPTO_MERGE_BYTES(aesState->buffers->iv[3], aesState->buffers->iv[ 2], aesState->buffers->iv[ 1], aesState->buffers->iv[ 0]);
    blockCount[ 1] = (uint32_t) CY_CRYPTO_MERGE_BYTES(aesState->buffers->iv[ 7], aesState->buffers->iv[ 6], aesState->buffers->iv[ 5], aesState->buffers->iv[ 4]);
    blockCount[ 2] = (uint32_t) CY_CRYPTO_MERGE_BYTES(aesState->buffers->iv[11], aesState->buffers->iv[10], aesState->buffers->iv[ 9], aesState->buffers->iv[ 8]);
    blockCount[ 3] = (uint32_t) CY_CRYPTO_MERGE_BYTES(aesState->buffers->iv[15], aesState->buffers->iv[14], aesState->buffers->iv[13], aesState->buffers->iv[12]);

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    /* Flush the cache */
    SCB_CleanDCache_by_Addr((volatile void *)blockCount, (int32_t)blockCount_size);
#endif

    counter = CY_SWAP_ENDIAN64(*(uint64_t*)(blockCount + CY_CRYPTO_AES_CTR_CNT_POS));

    Cy_Crypto_Core_V2_Aes_LoadEncKey(base, aesState);

    Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD1, (const uint8_t *) blockCounter, CY_CRYPTO_AES_BLOCK_SIZE);
    Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_BLOCK0,   CY_CRYPTO_V2_RB_FF_LOAD1, CY_CRYPTO_AES_BLOCK_SIZE);

    /* CTR counter is placed into last 4 bytes of the Nonce block */
    Cy_Crypto_Core_V2_RBSetByte(base, CY_CRYPTO_AES_BLOCK_SIZE - 4U, (uint8_t)((counter >> 24U) & 0xffU));
    Cy_Crypto_Core_V2_RBSetByte(base, CY_CRYPTO_AES_BLOCK_SIZE - 3U, (uint8_t)((counter >> 16U) & 0xffU));
    Cy_Crypto_Core_V2_RBSetByte(base, CY_CRYPTO_AES_BLOCK_SIZE - 2U, (uint8_t)((counter >>  8U) & 0xffU));
    Cy_Crypto_Core_V2_RBSetByte(base, CY_CRYPTO_AES_BLOCK_SIZE - 1U, (uint8_t)((counter) & 0xffU));

    if (aesState->unProcessedBytes == 0u)
    {
        Cy_Crypto_Core_V2_RunAes(base);
        Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_STORE, unprocessedRemap, CY_CRYPTO_AES_BLOCK_SIZE);
        Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_FF_STORE, CY_CRYPTO_V2_RB_BLOCK1, CY_CRYPTO_AES_BLOCK_SIZE);
    }
    else
    {
        bytes_rem = CY_CRYPTO_AES_BLOCK_SIZE - aesState->unProcessedBytes;
        if (srcSize < bytes_rem)
        {
            bytes_rem = srcSize;
        }
        Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD1, &unprocessedRemap[aesState->unProcessedBytes], bytes_rem);
        Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_BLOCK1,   CY_CRYPTO_V2_RB_FF_LOAD1, bytes_rem);

        Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD0, srcRemap, bytes_rem);
        Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_STORE, dstRemap, bytes_rem);

        Cy_Crypto_Core_V2_BlockXor(base, CY_CRYPTO_V2_RB_BLOCK0, CY_CRYPTO_V2_RB_FF_LOAD0, CY_CRYPTO_V2_RB_BLOCK1, bytes_rem);
        Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_FF_STORE, CY_CRYPTO_V2_RB_BLOCK0, bytes_rem);

        srcSize -= bytes_rem;
        aesState->unProcessedBytes += bytes_rem;
        srcRemap += bytes_rem;
        dstRemap += bytes_rem;


